#include <iostream>

using namespace std;

int main()

{
	// 숙제
	// oop(객체지향) 의 특징 5가지 알아오기

	/*
	
	1. 캡슐화

		실제로 구현 부분을 외부에 드러나지 않도록 하는 것
		변수와 메소드를 하나로 묶음
		데이터를 외부에서 직접 접근하지 않고 함수를 통해서만 접근
		ex) public, private, protected
		public : 클래스 외부에서 접근 가능
		private : 클래스 내부에서만 접근 가능
		protected : 상속받은 자식 클래스에서만 접근 가능

	2. 상속

		자식 클래스가 부모 클래스의 특성과 기능을 물려받는 것
		기능의 일부분을 변경하는 경우 자식 클래스에서 상속받아 수정 및 사용함
		상속은 캡슐화를 유지, 클래스의 재사용이 용이하도록 해 준다.

	3. 추상화

		인터페이스로 클래스들의 공통적인 특성(변수, 메소드)들을 묶어 표현하는 것

	4. 다형성

		어떤 변수,메소드가 상황에 따라 다른 결과를 내는 것

	5. 정보은닉

		캡슐화에서 가장 중요한 개념으로, 다른 객체에게 자신의 정보를 숨기고 자신의 연산만을 통하여 접근을 허용하는 것.
		각 객체의 수정이 다른 객체에게 주는 영향을 최소화 하는 기술.
		외부 객체가 특정 객체의 데이터와 함수를 직접 접근하여 사용하거나 변경하지 못하므로 유지보수와 소프트웨어 확장 시 오류를 최소화 할 수 있다.

	*/



	return 0;
}